МПР/src/Catalogs/ВидыОплатЧекаККМ/ВидыОплатЧекаККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОплатЧекаККМ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>БанковскийПлатеж</name>
      <description>Банковский платеж</description>
    </items>
    <items>
      <name>ВстречноеПредоставление</name>
      <description>Встречное предоставление</description>
    </items>
    <items>
      <name>ЗачетАванса</name>
      <description>Зачет аванса</description>
    </items>
    <items>
      <name>Наличные</name>
      <description>Наличные</description>
    </items>
    <items>
      <name>ОплатаБонусамиКакСкидкой</name>
      <description>Оплата бонусами (распределяется как скидка)</description>
    </items>
    <items>
      <name>ОплатаВрассрочку</name>
      <description>Оплата в рассрочку</description>
    </items>
    <items>
      <name>ОплатаПодарочнымСертификатом</name>
      <description>Оплата подарочным сертификатом</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.ТипыОплатЧекаККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>БанкКредитор</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентБанковскойКомиссии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлатежнаяСистема</name>
    <type>
      <types>EnumRef.ТипыПлатежнойСистемыККТ</types>
    </type>
  </attributes>
</mdclass:Catalog>

МПР/src/Enums/ТипыОплатЧекаККМ/ТипыОплатЧекаККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОплатЧекаККМ</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Наличные</name>
  </enumValues>
  <enumValues>
    <name>ПлатежнаяКарта</name>
  </enumValues>
  <enumValues>
    <name>БанковскийКредит</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
  <enumValues>
    <name>Бонусы</name>
  </enumValues>
  <enumValues>
    <name>ЗачетАванса</name>
  </enumValues>
  <enumValues>
    <name>ВРассрочку</name>
  </enumValues>
  <enumValues>
    <name>ПлатежнаяСистема</name>
  </enumValues>
  <enumValues>
    <name>БанковскийПлатеж</name>
  </enumValues>
  <enumValues>
    <name>ВстречноеПредоставление</name>
  </enumValues>
</mdclass:Enum>

МПР/src/Enums/ТипыПлатежнойСистемыККТ/ТипыПлатежнойСистемыККТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПлатежнойСистемыККТ</name>
  <enumValues>
    <name>СистемаБыстрыхПлатежей</name>
  </enumValues>
  <enumValues>
    <name>SWiP</name>
  </enumValues>
  <enumValues>
    <name>СертификатНСПК</name>
  </enumValues>
</mdclass:Enum>

МПР/src/Catalogs/ВидыОплатЧекаККМ/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ТипОплаты <> Перечисления.ТипыОплатЧекаККМ.БанковскийКредит Тогда 
		МассивНепроверяемыхРеквизитов.Добавить("БанкКредитор");
		МассивНепроверяемыхРеквизитов.Добавить("ПроцентБанковскойКомиссии");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

// Обработчик события "ПередЗаписью" объекта.
//
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		Если ТипОплаты <> Перечисления.ТипыОплатЧекаККМ.БанковскийКредит Тогда
			БанкКредитор = Справочники.Контрагенты.ПустаяСсылка();
			ПроцентБанковскойКомиссии = 0;
		КонецЕсли;
		
		Если ЭтоНовый() И ТипОплаты = Перечисления.ТипыОплатЧекаККМ.ПлатежнаяСистема
			И ПлатежнаяСистема = Перечисления.ТипыПлатежнойСистемыККТ.СертификатНСПК Тогда
			
			ВидОплатыНСПК = ЭлектронныеСертификатыНСПКРТ.ВидОплатыПлатежнаяСистемаНСПК();
			Если ЗначениеЗаполнено(ВидОплатыНСПК) Тогда
				Отказ = Истина;
				СтрокаСообщения = НСтр("ru = 'Вид оплаты с такими параметрами уже существует:
				|ТипОплаты      - Платежная система
				|ПлатежнаяСистема  - Сертификат НСПК'");
				
				ОбщегоНазначения.СообщитьПользователю(СтрокаСообщения)
			КонецЕсли;
		
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
